const newsData = [
  {
    title: "عنوان الخبر ",
    date: "12 حزيران 2025",
    img: "/assets/images/cardsImg.png",
    desc: `تمويل لشراء احتياجاتك من شركائنا (تأمين المركبات، خدمات طبية للأسنان، محروقات…) وتقسيط يصل حتى 12 شهراً
كهربائية وإلكترونية، أثاث منزلي، صيانة ودهان سيارات، خدمات...`,
  },
  {
    title: "عنوان الخبر ",
    date: "15 حزيران 2025",
    img: "/assets/images/cardsImg.png",
    desc: `تمويل لشراء احتياجاتك من شركائنا (تأمين المركبات، خدمات طبية للأسنان، محروقات…) وتقسيط يصل حتى 12 شهراً
كهربائية وإلكترونية، أثاث منزلي، صيانة ودهان سيارات، خدمات...`,
  },
  {
    title: "عنوان الخبر ",
    date: "20 حزيران 2025",
    img: "/assets/images/cardsImg.png",
    desc: `تمويل لشراء احتياجاتك من شركائنا (تأمين المركبات، خدمات طبية للأسنان، محروقات…) وتقسيط يصل حتى 12 شهراً
كهربائية وإلكترونية، أثاث منزلي، صيانة ودهان سيارات، خدمات...`,
  },
  {
    title: "عنوان الخبر ",
    date: "12 حزيران 2025",
    img: "/assets/images/cardsImg.png",
    desc: `تمويل لشراء احتياجاتك من شركائنا (تأمين المركبات، خدمات طبية للأسنان، محروقات…) وتقسيط يصل حتى 12 شهراً
كهربائية وإلكترونية، أثاث منزلي، صيانة ودهان سيارات، خدمات...`,
  },
  {
    title: "عنوان الخبر ",
    date: "15 حزيران 2025",
    img: "/assets/images/cardsImg.png",
    desc: `تمويل لشراء احتياجاتك من شركائنا (تأمين المركبات، خدمات طبية للأسنان، محروقات…) وتقسيط يصل حتى 12 شهراً
كهربائية وإلكترونية، أثاث منزلي، صيانة ودهان سيارات، خدمات...`,
  },
  {
    title: "عنوان الخبر ",
    date: "20 حزيران 2025",
    img: "/assets/images/cardsImg.png",
    desc: `تمويل لشراء احتياجاتك من شركائنا (تأمين المركبات، خدمات طبية للأسنان، محروقات…) وتقسيط يصل حتى 12 شهراً
كهربائية وإلكترونية، أثاث منزلي، صيانة ودهان سيارات، خدمات...`,
  },
  {
    title: "عنوان الخبر ",
    date: "12 حزيران 2025",
    img: "/assets/images/cardsImg.png",
    desc: `تمويل لشراء احتياجاتك من شركائنا (تأمين المركبات، خدمات طبية للأسنان، محروقات…) وتقسيط يصل حتى 12 شهراً
كهربائية وإلكترونية، أثاث منزلي، صيانة ودهان سيارات، خدمات...`,
  },
  {
    title: "عنوان الخبر ",
    date: "15 حزيران 2025",
    img: "/assets/images/cardsImg.png",
    desc: `تمويل لشراء احتياجاتك من شركائنا (تأمين المركبات، خدمات طبية للأسنان، محروقات…) وتقسيط يصل حتى 12 شهراً
كهربائية وإلكترونية، أثاث منزلي، صيانة ودهان سيارات، خدمات...`,
  },
  {
    title: "عنوان الخبر ",
    date: "20 حزيران 2025",
    img: "/assets/images/cardsImg.png",
    desc: `تمويل لشراء احتياجاتك من شركائنا (تأمين المركبات، خدمات طبية للأسنان، محروقات…) وتقسيط يصل حتى 12 شهراً
كهربائية وإلكترونية، أثاث منزلي، صيانة ودهان سيارات، خدمات...`,
  },
];

const newsCards = document.getElementById("newsCards");

newsData.forEach((item) => {
  const card = document.createElement("div");
  card.className = "newsCardsContent";
  card.innerHTML = `
    <a href="/pages/newsInnerPage.html" class="newsCardLink">
      <img src="${item.img}" alt="${item.title}" class="newsCardsImage" />
      <div class="newsCardText">
        <h1>${item.title}</h1>
        <p class="date">${item.date}</p>
        <p class="newsPara">
          ${item.desc} <span>معرفة المزيد</span>
        </p>
      </div>
    </a>
  `;
  newsCards.appendChild(card);
});
